#### 1. Import pandas library

In [1]:
import pandas as pd

#### 2. Import pymysql and sqlalchemy as you have learnt in the lesson of importing/exporting data

In [2]:
!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (1.4.22)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (4.6.4)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy) (1.1.1)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.5.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy) (3.7.4.3)
Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
     |████████████████████████████████| 43 kB 905 kB/s
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [3]:
import pymysql
from sqlalchemy import create_engine

#### 3. Create a mysql engine to set the connection to the server. Check the connection details in [this link](https://relational.fit.cvut.cz/search?tableCount%5B%5D=0-10&tableCount%5B%5D=10-30&dataType%5B%5D=Numeric&databaseSize%5B%5D=KB&databaseSize%5B%5D=MB)

In [4]:
# dialect+driver://username:password@host:port/database  Formula
engine = create_engine('mysql+pymysql://guest:relational@relational.fit.cvut.cz:3306/stats')

#### 4. Import the users table

In [5]:
users = pd.read_sql_query('SELECT * FROM users', engine)

#### 5. Rename Id column to userId

In [6]:
users = users.rename(columns={'Id': 'userId'})
users

       userId  ...                                    ProfileImageUrl
0          -1  ...                                               None
1           2  ...                                               None
2           3  ...                                               None
3           4  ...                 http://i.stack.imgur.com/d1oHX.jpg
4           5  ...                                               None
...       ...  ...                                                ...
40320   55743  ...  http://graph.facebook.com/665821703/picture?ty...
40321   55744  ...                                               None
40322   55745  ...  https://www.gravatar.com/avatar/faa7a3fdbd8308...
40323   55746  ...  https://www.gravatar.com/avatar/6d9e9fa6b783a3...
40324   55747  ...  https://lh4.googleusercontent.com/-ZsXhwVaFmiY...

[40325 rows x 14 columns]

#### 6. Import the posts table.

In [7]:
posts = pd.read_sql_query('SELECT * FROM posts', engine)

#### 7. Rename Id column to postId and OwnerUserId to userId

In [8]:
posts = posts.rename(columns={'Id': 'postId', 'OwnerUserId': 'userId'})
posts.head()

   postId  PostTypeId  ...  OwnerDisplayName LastEditorDisplayName
0       1           1  ...              None                  None
1       2           1  ...              None                  None
2       3           1  ...              None                  None
3       4           1  ...              None                  None
4       5           2  ...              None                  None

[5 rows x 21 columns]

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: userId, Reputation,Views,UpVotes,DownVotes
    **posts columns**: postId, Score,userID,ViewCount,CommentCount

In [9]:
users_selec_columns = users[['userId', 'Reputation', 'Views', 'UpVotes', 'DownVotes']]
posts_selec_columns = posts[['postId', 'Score', 'userId', 'ViewCount', 'CommentCount']]

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [10]:
merge_df = pd.merge(left=users_selec_columns , right=posts_selec_columns, left_on='userId', right_on='userId')
merge_df

       userId  Reputation  Views  ...  Score  ViewCount  CommentCount
0          -1           1      0  ...      0        NaN             0
1          -1           1      0  ...      0        NaN             0
2          -1           1      0  ...      0        NaN             0
3          -1           1      0  ...      0        NaN             0
4          -1           1      0  ...      0        NaN             0
...       ...         ...    ...  ...    ...        ...           ...
90579   55734           1      0  ...      0       16.0             0
90580   55738          11      0  ...      2       40.0             4
90581   55742           6      0  ...      1       17.0             0
90582   55744           6      1  ...      1       13.0             2
90583   55746         106      1  ...      1        5.0             2

[90584 rows x 9 columns]

#### 9. How many missing values do you have in your merged dataframe? On which columns?

In [11]:
merge_df.isnull().sum()

userId              0
Reputation          0
Views               0
UpVotes             0
DownVotes           0
postId              0
Score               0
ViewCount       48396
CommentCount        0
dtype: int64

#### 10. You will need to make something with missing values.  Will you clean or filling them? Explain. 
**Remember** to check the results of your code before passing to the next step

In [12]:
null_cols = merge_df.isnull().mean().sort_values() 
null_cols
# 53% de los datos de la columna ViewCount son nulos

userId          0.000000
Reputation      0.000000
Views           0.000000
UpVotes         0.000000
DownVotes       0.000000
postId          0.000000
Score           0.000000
CommentCount    0.000000
ViewCount       0.534267
dtype: float64

In [13]:
merge_df[merge_df['ViewCount'].isnull() == True] #df con valores NaN

       userId  Reputation  Views  ...  Score  ViewCount  CommentCount
0          -1           1      0  ...      0        NaN             0
1          -1           1      0  ...      0        NaN             0
2          -1           1      0  ...      0        NaN             0
3          -1           1      0  ...      0        NaN             0
4          -1           1      0  ...      0        NaN             0
...       ...         ...    ...  ...    ...        ...           ...
90518   55605           1      2  ...      0        NaN             0
90521   55609           1      1  ...      2        NaN             0
90528   55621           1      1  ...      0        NaN             0
90536   55637          26      4  ...      1        NaN             0
90575   55729          16      1  ...      0        NaN             0

[48396 rows x 9 columns]

In [15]:
merge_df[(merge_df['ViewCount'].isnull() == True) & (merge_df['CommentCount'] > 0)] #df con valores Nan y CommentCount > a 0

       userId  Reputation  Views  ...  Score  ViewCount  CommentCount
212         5        6792   1145  ...     20        NaN             1
216         5        6792   1145  ...     22        NaN             3
220         5        6792   1145  ...     14        NaN             1
222         5        6792   1145  ...     26        NaN             4
224         5        6792   1145  ...     21        NaN             2
...       ...         ...    ...  ...    ...        ...           ...
90452   55494          11      0  ...      1        NaN             1
90456   55501           1      0  ...      0        NaN             1
90494   55562           1      0  ...      0        NaN             1
90497   55570           1      0  ...      0        NaN             2
90499   55574          21      1  ...      2        NaN             1

[26471 rows x 9 columns]

In [16]:
drop_cols = list(null_cols[null_cols > 0.15].index) # Buscamos las columnas con mas de 15% de datos nulos
merge_df_clean = merge_df.drop(drop_cols, axis=1) # Dropeamos la columna 
merge_df_clean.head()

   userId  Reputation  Views  UpVotes  DownVotes  postId  Score  CommentCount
0      -1           1      0     5007       1920    2175      0             0
1      -1           1      0     5007       1920    8576      0             0
2      -1           1      0     5007       1920    8578      0             0
3      -1           1      0     5007       1920    8981      0             0
4      -1           1      0     5007       1920    8982      0             0

#### 11. Adjust the data types in order to avoid future issues. Which ones should be changed?

In [17]:
merge_df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 90584 entries, 0 to 90583
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   userId        90584 non-null  int64
 1   Reputation    90584 non-null  int64
 2   Views         90584 non-null  int64
 3   UpVotes       90584 non-null  int64
 4   DownVotes     90584 non-null  int64
 5   postId        90584 non-null  int64
 6   Score         90584 non-null  int64
 7   CommentCount  90584 non-null  int64
dtypes: int64(8)
memory usage: 6.2 MB

In [18]:
merge_df_clean.describe()

             userId    Reputation  ...         Score  CommentCount
count  90584.000000  90584.000000  ...  90584.000000  90584.000000
mean   16546.764727   6282.395412  ...      2.780767      1.894650
std    15273.367108  15102.268670  ...      4.948922      2.638704
min       -1.000000      1.000000  ...    -19.000000      0.000000
25%     3437.000000     60.000000  ...      1.000000      0.000000
50%    11032.000000    396.000000  ...      2.000000      1.000000
75%    27700.000000   4460.000000  ...      3.000000      3.000000
max    55746.000000  87393.000000  ...    192.000000     45.000000

[8 rows x 8 columns]

#### Bonus: Identify extreme values in your merged dataframe as you have learned in class, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder.